## Midterm Project 1

DS2002 - Tupitza | 
Megan Doan | 
Database used: Sakila

### Importing Libraries

In [1]:
import os
import numpy
import pandas as pd
from sqlalchemy import create_engine
import json
import datetime
import pymongo

### Importing data from SQL : 

importing : sakila.customer, sakila.film, sakila.address, sakila.payment

In [2]:
# declare and assign local connection : 
host_name = "localhost"
host_ip = "127.0.0.1"
port = "3306"
user_id = "root"
pwd = "Passw0rd123"

src_dbname = "sakila"
dst_dbname = "sakila_dw"

In [64]:
def get_dataframe(user_id, pwd, host_name, db_name, sql_query):
    try:
        conn_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}/{db_name}"
        sqlEngine = create_engine(conn_str, pool_recycle=3600)
        connection = sqlEngine.connect()
        dframe = pd.read_sql(sql_query, connection);
        connection.close()
    
        return dframe
    except:
        print('Error: failure to retreive dataframe')


def set_dataframe(user_id, pwd, host_name, db_name, df, table_name, pk_column, db_operation):
    try:
        conn_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}/{db_name}"
        sqlEngine = create_engine(conn_str, pool_recycle=3600)
        connection = sqlEngine.connect()
    
        if db_operation == "insert":
            df.to_sql(table_name, con=connection, index=False, if_exists='replace')
            sqlEngine.execute(f"ALTER TABLE {table_name} ADD PRIMARY KEY ({pk_column});")
            
        elif db_operation == "update":
            df.to_sql(table_name, con=connection, index=False, if_exists='append')
    
        connection.close()
    except:
        print('Error: failure to set dataframe')

In [65]:
conn_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}"
sqlEngine = create_engine(conn_str, pool_recycle=3600)

sqlEngine.execute(f"DROP DATABASE IF EXISTS `{dst_dbname}`;")
sqlEngine.execute(f"CREATE DATABASE `{dst_dbname}`;")
sqlEngine.execute(f"USE {dst_dbname};")

In [66]:
sql_customer = "SELECT * FROM sakila.customer;"
df_customers = get_dataframe(user_id, pwd, host_name, src_dbname, sql_customer)
df_customers.head()

,customer_id,store_id,first_name,last_name,email,address_id,active,create_date,last_update
0,1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,5,1,2006-02-14 22:04:36,2006-02-15 04:57:20
1,2,1,PATRICIA,JOHNSON,PATRICIA.JOHNSON@sakilacustomer.org,6,1,2006-02-14 22:04:36,2006-02-15 04:57:20
2,3,1,LINDA,WILLIAMS,LINDA.WILLIAMS@sakilacustomer.org,7,1,2006-02-14 22:04:36,2006-02-15 04:57:20
3,4,2,BARBARA,JONES,BARBARA.JONES@sakilacustomer.org,8,1,2006-02-14 22:04:36,2006-02-15 04:57:20
4,5,1,ELIZABETH,BROWN,ELIZABETH.BROWN@sakilacustomer.org,9,1,2006-02-14 22:04:36,2006-02-15 04:57:20

In [67]:
sql_film = "SELECT * FROM sakila.film;"
df_film = get_dataframe(user_id, pwd, host_name, src_dbname, sql_film)
df_film.head(5)

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,None,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,None,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,None,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",2006-02-15 05:03:42
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,None,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",2006-02-15 05:03:42
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,None,6,2.99,130,22.99,G,Deleted Scenes,2006-02-15 05:03:42

In [60]:
sql_address = "SELECT * FROM sakila.address;"
df_address = get_dataframe(user_id, pwd, host_name, src_dbname, sql_address)
df_address.head(5)

,address_id,address,address2,district,city_id,postal_code,phone,location,last_update
0,1,47 MySakila Drive,None,Alberta,300,,,b'\x00\x00\x00\x00\x01\x01\x00\x00\x00>\n2]c4\...,2014-09-25 22:30:27
1,2,28 MySQL Boulevard,None,QLD,576,,,b'\x00\x00\x00\x00\x01\x01\x00\x00\x00\x8e\x10...,2014-09-25 22:30:09
2,3,23 Workhaven Lane,None,Alberta,300,,14033335568,b'\x00\x00\x00\x00\x01\x01\x00\x00\x00\xcd\xc4...,2014-09-25 22:30:27
3,4,1411 Lillydale Drive,None,QLD,576,,6172235589,b'\x00\x00\x00\x00\x01\x01\x00\x00\x00[\r\xe44...,2014-09-25 22:30:09
4,5,1913 Hanoi Way,,Nagasaki,463,35200,28303384290,b'\x00\x00\x00\x00\x01\x01\x00\x00\x00(\xd17\x...,2014-09-25 22:31:53

In [61]:
sql_payment = "SELECT * FROM sakila.payment;"
df_payment = get_dataframe(user_id, pwd, host_name, src_dbname, sql_payment)
df_payment.head(5)

,payment_id,customer_id,staff_id,rental_id,amount,payment_date,last_update
0,1,1,1,76.0,2.99,2005-05-25 11:30:37,2006-02-15 22:12:30
1,2,1,1,573.0,0.99,2005-05-28 10:35:23,2006-02-15 22:12:30
2,3,1,1,1185.0,5.99,2005-06-15 00:54:12,2006-02-15 22:12:30
3,4,1,2,1422.0,0.99,2005-06-15 18:02:53,2006-02-15 22:12:30
4,5,1,2,1476.0,9.99,2005-06-15 21:08:46,2006-02-15 22:12:30

### Importing data from local file (CSV): 

importing: sakila.inventory, sakila.rental

In [9]:
df_inventory = pd.read_csv('/Users/ds2002-02-student/Downloads/sakila.inventory.csv', header=0)
df_inventory.head()

   inventory_id  film_id  store_id
0             1        1         1
1             2        1         1
2             3        1         1
3             4        1         1
4            16        4         1

In [10]:
df_rental = pd.read_csv('/Users/ds2002-02-student/Downloads/sakila.rental.csv', header=0)
df_rental.head()

   rental_id          rental_date  inventory_id  customer_id  staff_id
0          1  2005-05-24 22:53:30           367          130         1
1          2  2005-05-24 22:54:33          1525          459         1
2          3  2005-05-24 23:03:39          1711          408         1
3          4  2005-05-24 23:04:41          2452          333         2
4          5  2005-05-24 23:05:21          2079          222         1

### Importing data fron MongoDB(JSON)

In [11]:
mysql_uid = "root"
mysql_pwd = "Passw0rd123"

atlas_cluster_name = "sandbox.zibbf"
atlas_user_name = "m001-student"
atlas_password = "m001-mongodb-basics"

conn_str = {"local" : f"mongodb://localhost:27017/",
    "atlas" : f"mongodb+srv://{atlas_user_name}:{atlas_password}@{atlas_cluster_name}.mongodb.net"
}

src_dbname = "sakila"
dst_dbname = "sakila_dw"

print(f"Local Connection String: {conn_str['local']}")
#print(f"Atlas Connection String: {conn_str['atlas']}")

Local Connection String: mongodb://localhost:27017/

In [12]:
def get_sql_dataframe(user_id, pwd, db_name, sql_query):
    try:
        '''Create a connection to the MySQL database'''
        conn_str = f"mysql+pymysql://{user_id}:{pwd}@localhost/{db_name}"
        sqlEngine = create_engine(conn_str, pool_recycle=3600)
    
        '''Invoke the pd.read_sql() function to query the database, and fill a Pandas DataFrame.'''
        conn = sqlEngine.connect()
        dframe = pd.read_sql(sql_query, conn);
        conn.close()
    
        return dframe
    except:
        print('Error: failure to get dataframe')


def get_mongo_dataframe(connect_str, db_name, collection, query):
    try:
        '''Create a connection to MongoDB'''
        client = pymongo.MongoClient(connect_str)
    
        '''Query MongoDB, and fill a python list with documents to create a DataFrame'''
        db = client[db_name]
        dframe = pd.DataFrame(list(db[collection].find(query)))
        dframe.drop(['_id'], axis=1, inplace=True)
        client.close()
        return dframe
    except:
        print('Error: failure to get dataframe in MongoDB')

In [13]:
client = pymongo.MongoClient(conn_str["local"])
db = client[src_dbname]


data_dir = os.path.join('C:/Users/ds2002-02-student/Documents/DS-2002-002-main/Projects/data')

json_files = {"df_staff" : 'sakila.staff.json'}

for file in json_files:
    try:
        db.drop_collection(file)
        json_file = os.path.join(data_dir, json_files[file])
        with open(json_file, 'r') as openfile:
            json_object = json.load(openfile)
            file = db[file]
            result = file.insert_many(json_object)
            print(f"{file} was successfully loaded.")
    except:
        print('Error: failure to retrieve JSON file')

        
client.close()

Collection(Database(MongoClient(host=['localhost:27017'], document_class=dict, tz_aware=False, connect=True), 'sakila'), 'df_staff') was successfully loaded.

In [14]:
query = {}
collection = "df_staff"

df_staff = get_mongo_dataframe(conn_str['local'], src_dbname, collection, query)
df_staff.head(2)

   staff_id first_name last_name  store_id
0         1       Mike   Hillyer         1
1         2        Jon  Stephens         2

### Modifying the columns 
Dataframes I have loaded in: df_customers, df_film, df_inventory, df_rental, df_staff, df_address, df_payment

In [15]:
drop_cols = ['email','active','create_date','last_update']
df_customers.drop(drop_cols, axis=1, inplace=True)
df_customers.head(2)

   customer_id  store_id first_name last_name  address_id
0            1         1       MARY     SMITH           5
1            2         1   PATRICIA   JOHNSON           6

In [16]:
df_customers.rename(columns={"customer_id":"customer_key", "store_id":"store_key","address_id":"address_key"}, inplace=True)
df_customers.head(5)

   customer_key  store_key first_name last_name  address_key
0             1          1       MARY     SMITH            5
1             2          1   PATRICIA   JOHNSON            6
2             3          1      LINDA  WILLIAMS            7
3             4          2    BARBARA     JONES            8
4             5          1  ELIZABETH     BROWN            9

In [17]:
drop_cols = ['description','release_year','language_id','original_language_id', 'length', 'special_features', 'last_update']
df_film.drop(drop_cols, axis=1, inplace=True)
df_film.head(2)

,film_id,title,rental_duration,rental_rate,replacement_cost,rating
0,1,ACADEMY DINOSAUR,6,0.99,20.99,PG
1,2,ACE GOLDFINGER,3,4.99,12.99,G

In [18]:
df_film.rename(columns={"film_id" : "film_key"}, inplace=True)
df_film.head(5)

,film_key,title,rental_duration,rental_rate,replacement_cost,rating
0,1,ACADEMY DINOSAUR,6,0.99,20.99,PG
1,2,ACE GOLDFINGER,3,4.99,12.99,G
2,3,ADAPTATION HOLES,7,2.99,18.99,NC-17
3,4,AFFAIR PREJUDICE,5,2.99,26.99,G
4,5,AFRICAN EGG,6,2.99,22.99,G

In [19]:
df_inventory.rename(columns={"film_id" : "film_key", "store_id" : "store_key", "inventory_id" : "inventory_key"}, inplace=True)
df_inventory.head()

   inventory_key  film_key  store_key
0              1         1          1
1              2         1          1
2              3         1          1
3              4         1          1
4             16         4          1

In [20]:
df_rental.rename(columns={"rental_id": "rental_key", "inventory_id" : "inventory_key", "customer_id" : "customer_key", "staff_id" : "staff_key"}, inplace=True)
df_rental.head()

   rental_key          rental_date  inventory_key  customer_key  staff_key
0           1  2005-05-24 22:53:30            367           130          1
1           2  2005-05-24 22:54:33           1525           459          1
2           3  2005-05-24 23:03:39           1711           408          1
3           4  2005-05-24 23:04:41           2452           333          2
4           5  2005-05-24 23:05:21           2079           222          1

In [21]:
df_payment.rename(columns={"rental_id" : "rental_key", 'payment_id' : 'payment_key', 'customer_id' : 'customer_key', 'staff_id' : 'staff_key'}, inplace=True)
df_payment.head()

,payment_key,customer_key,staff_key,rental_key,amount,payment_date,last_update
0,1,1,1,76.0,2.99,2005-05-25 11:30:37,2006-02-15 22:12:30
1,2,1,1,573.0,0.99,2005-05-28 10:35:23,2006-02-15 22:12:30
2,3,1,1,1185.0,5.99,2005-06-15 00:54:12,2006-02-15 22:12:30
3,4,1,2,1422.0,0.99,2005-06-15 18:02:53,2006-02-15 22:12:30
4,5,1,2,1476.0,9.99,2005-06-15 21:08:46,2006-02-15 22:12:30

In [22]:
df_staff.rename(columns={"staff_id" : "staff_key", "store_id" : "store_key"}, inplace=True)
df_staff.head()

   staff_key first_name last_name  store_key
0          1       Mike   Hillyer          1
1          2        Jon  Stephens          2

In [23]:
df_address.rename(columns = {'address_id': 'address_key'}, inplace = True)
df_address.head(5)

,address_key,address,address2,district,city_id,postal_code,phone,location,last_update
0,1,47 MySakila Drive,None,Alberta,300,,,b'\x00\x00\x00\x00\x01\x01\x00\x00\x00>\n2]c4\...,2014-09-25 22:30:27
1,2,28 MySQL Boulevard,None,QLD,576,,,b'\x00\x00\x00\x00\x01\x01\x00\x00\x00\x8e\x10...,2014-09-25 22:30:09
2,3,23 Workhaven Lane,None,Alberta,300,,14033335568,b'\x00\x00\x00\x00\x01\x01\x00\x00\x00\xcd\xc4...,2014-09-25 22:30:27
3,4,1411 Lillydale Drive,None,QLD,576,,6172235589,b'\x00\x00\x00\x00\x01\x01\x00\x00\x00[\r\xe44...,2014-09-25 22:30:09
4,5,1913 Hanoi Way,,Nagasaki,463,35200,28303384290,b'\x00\x00\x00\x00\x01\x01\x00\x00\x00(\xd17\x...,2014-09-25 22:31:53

In [24]:
drop_cols = ['address2','city_id','postal_code','location', 'last_update']
df_address.drop(drop_cols, axis=1, inplace=True)
df_address.head(2)

   address_key             address district phone
0            1   47 MySakila Drive  Alberta
1            2  28 MySQL Boulevard      QLD

### Merge the tables

In [25]:
# merging for customers table
dim_customer = pd.merge(df_customers, df_address, on = 'address_key', how = 'inner')

In [26]:
drop_cols = ['store_key','address_key']
dim_customer.drop(drop_cols, axis=1, inplace=True)
dim_customer.head(5)

,customer_key,first_name,last_name,address,district,phone
0,1,MARY,SMITH,1913 Hanoi Way,Nagasaki,28303384290
1,2,PATRICIA,JOHNSON,1121 Loja Avenue,California,838635286649
2,3,LINDA,WILLIAMS,692 Joliet Street,Attika,448477190408
3,4,BARBARA,JONES,1566 Inegl Manor,Mandalay,705814003527
4,5,ELIZABETH,BROWN,53 Idfu Parkway,Nantou,10655648674

In [27]:
# merging for rental table
dfrent1 = pd.merge(df_rental,df_payment, on=['staff_key','rental_key', 'customer_key'], how = 'inner')
dfrent1.head()

,rental_key,rental_date,inventory_key,customer_key,staff_key,payment_key,amount,payment_date,last_update
0,1,2005-05-24 22:53:30,367,130,1,3504,2.99,2005-05-24 22:53:30,2006-02-15 22:13:16
1,5,2005-05-24 23:05:21,2079,222,1,6003,6.99,2005-05-24 23:05:21,2006-02-15 22:14:21
2,6,2005-05-24 23:08:07,2792,549,1,14728,0.99,2005-05-24 23:08:07,2006-02-15 22:21:42
3,7,2005-05-24 23:11:53,3995,269,2,7274,1.99,2005-05-24 23:11:53,2006-02-15 22:15:08
4,8,2005-05-24 23:31:46,2346,239,2,6440,4.99,2005-05-24 23:31:46,2006-02-15 22:14:39

In [28]:
dim_rental = pd.merge(dfrent1, df_staff, on = 'staff_key', how = 'inner')
dim_rental.head()

,rental_key,rental_date,inventory_key,customer_key,staff_key,payment_key,amount,payment_date,last_update,first_name,last_name,store_key
0,1,2005-05-24 22:53:30,367,130,1,3504,2.99,2005-05-24 22:53:30,2006-02-15 22:13:16,Mike,Hillyer,1
1,5,2005-05-24 23:05:21,2079,222,1,6003,6.99,2005-05-24 23:05:21,2006-02-15 22:14:21,Mike,Hillyer,1
2,6,2005-05-24 23:08:07,2792,549,1,14728,0.99,2005-05-24 23:08:07,2006-02-15 22:21:42,Mike,Hillyer,1
3,9,2005-05-25 00:00:40,2580,126,1,3386,4.99,2005-05-25 00:00:40,2006-02-15 22:13:13,Mike,Hillyer,1
4,13,2005-05-25 00:22:55,2294,334,1,9014,6.99,2005-05-25 00:22:55,2006-02-15 22:16:18,Mike,Hillyer,1

In [29]:
drop_cols = ['staff_key', 'last_update']
dim_rental.drop(drop_cols, axis=1, inplace=True)
dim_rental.rename(columns = {'first_name': 'staff_firstname', 'last_name' : 'staff_lastname', 'amount': 'payment_amount'}, inplace = True)
dim_rental.head(5)

,rental_key,rental_date,inventory_key,customer_key,payment_key,payment_amount,payment_date,staff_firstname,staff_lastname,store_key
0,1,2005-05-24 22:53:30,367,130,3504,2.99,2005-05-24 22:53:30,Mike,Hillyer,1
1,5,2005-05-24 23:05:21,2079,222,6003,6.99,2005-05-24 23:05:21,Mike,Hillyer,1
2,6,2005-05-24 23:08:07,2792,549,14728,0.99,2005-05-24 23:08:07,Mike,Hillyer,1
3,9,2005-05-25 00:00:40,2580,126,3386,4.99,2005-05-25 00:00:40,Mike,Hillyer,1
4,13,2005-05-25 00:22:55,2294,334,9014,6.99,2005-05-25 00:22:55,Mike,Hillyer,1

In [30]:
# film
dim_film = df_film
dim_film.head(5)

,film_key,title,rental_duration,rental_rate,replacement_cost,rating
0,1,ACADEMY DINOSAUR,6,0.99,20.99,PG
1,2,ACE GOLDFINGER,3,4.99,12.99,G
2,3,ADAPTATION HOLES,7,2.99,18.99,NC-17
3,4,AFFAIR PREJUDICE,5,2.99,26.99,G
4,5,AFRICAN EGG,6,2.99,22.99,G

## Load Data into a Data Warehouse by creating new tables 
Dataframes I have loaded created: dim_rental, dim_customers, dim_film, fact_table

In [31]:
dim_rental.head(5)

,rental_key,rental_date,inventory_key,customer_key,payment_key,payment_amount,payment_date,staff_firstname,staff_lastname,store_key
0,1,2005-05-24 22:53:30,367,130,3504,2.99,2005-05-24 22:53:30,Mike,Hillyer,1
1,5,2005-05-24 23:05:21,2079,222,6003,6.99,2005-05-24 23:05:21,Mike,Hillyer,1
2,6,2005-05-24 23:08:07,2792,549,14728,0.99,2005-05-24 23:08:07,Mike,Hillyer,1
3,9,2005-05-25 00:00:40,2580,126,3386,4.99,2005-05-25 00:00:40,Mike,Hillyer,1
4,13,2005-05-25 00:22:55,2294,334,9014,6.99,2005-05-25 00:22:55,Mike,Hillyer,1

In [32]:
dim_customer.head(5)

,customer_key,first_name,last_name,address,district,phone
0,1,MARY,SMITH,1913 Hanoi Way,Nagasaki,28303384290
1,2,PATRICIA,JOHNSON,1121 Loja Avenue,California,838635286649
2,3,LINDA,WILLIAMS,692 Joliet Street,Attika,448477190408
3,4,BARBARA,JONES,1566 Inegl Manor,Mandalay,705814003527
4,5,ELIZABETH,BROWN,53 Idfu Parkway,Nantou,10655648674

In [33]:
dim_film.head(5)

,film_key,title,rental_duration,rental_rate,replacement_cost,rating
0,1,ACADEMY DINOSAUR,6,0.99,20.99,PG
1,2,ACE GOLDFINGER,3,4.99,12.99,G
2,3,ADAPTATION HOLES,7,2.99,18.99,NC-17
3,4,AFFAIR PREJUDICE,5,2.99,26.99,G
4,5,AFRICAN EGG,6,2.99,22.99,G

In [34]:
db_operation = "insert"

tables = [('rental', dim_rental, 'rental_key'),
          ('customer', dim_customer, 'customer_key'),
          ('film', dim_film, 'film_key'),
          ('inventory', df_inventory, 'inventory_key')]

In [35]:
for table_name, dataframe, primary_key in tables:
    set_dataframe(user_id, pwd, host_name, dst_dbname, dataframe, table_name, primary_key, db_operation)

### impliment solutions using pandas dataframe
proving all dataframes are loaded into SQL under sakila_dw

In [36]:
sql_customers = "SELECT * FROM sakila_dw.customer;"
df_customer = get_dataframe(user_id, pwd, host_name, src_dbname, sql_customers)
df_customer.head(5)

,customer_key,first_name,last_name,address,district,phone
0,1,MARY,SMITH,1913 Hanoi Way,Nagasaki,28303384290
1,2,PATRICIA,JOHNSON,1121 Loja Avenue,California,838635286649
2,3,LINDA,WILLIAMS,692 Joliet Street,Attika,448477190408
3,4,BARBARA,JONES,1566 Inegl Manor,Mandalay,705814003527
4,5,ELIZABETH,BROWN,53 Idfu Parkway,Nantou,10655648674

In [37]:
sql_film = "SELECT * FROM sakila_dw.film;"
df_film = get_dataframe(user_id, pwd, host_name, src_dbname, sql_film)
df_film.head(5)

,film_key,title,rental_duration,rental_rate,replacement_cost,rating
0,1,ACADEMY DINOSAUR,6,0.99,20.99,PG
1,2,ACE GOLDFINGER,3,4.99,12.99,G
2,3,ADAPTATION HOLES,7,2.99,18.99,NC-17
3,4,AFFAIR PREJUDICE,5,2.99,26.99,G
4,5,AFRICAN EGG,6,2.99,22.99,G

In [38]:
sql_inventory = "SELECT * FROM sakila_dw.inventory;"
df_inventory = get_dataframe(user_id, pwd, host_name, src_dbname, sql_inventory)
df_inventory.head(5)

   inventory_key  film_key  store_key
0              1         1          1
1              2         1          1
2              3         1          1
3              4         1          1
4              5         1          2

In [39]:
sql_rental = "SELECT * FROM sakila_dw.rental;"
df_rental = get_dataframe(user_id, pwd, host_name, src_dbname, sql_rental)
df_rental.head(5)

,rental_key,rental_date,inventory_key,customer_key,payment_key,payment_amount,payment_date,staff_firstname,staff_lastname,store_key
0,1,2005-05-24 22:53:30,367,130,3504,2.99,2005-05-24 22:53:30,Mike,Hillyer,1
1,5,2005-05-24 23:05:21,2079,222,6003,6.99,2005-05-24 23:05:21,Mike,Hillyer,1
2,6,2005-05-24 23:08:07,2792,549,14728,0.99,2005-05-24 23:08:07,Mike,Hillyer,1
3,7,2005-05-24 23:11:53,3995,269,7274,1.99,2005-05-24 23:11:53,Jon,Stephens,2
4,8,2005-05-24 23:31:46,2346,239,6440,4.99,2005-05-24 23:31:46,Jon,Stephens,2

### Creating a Fact Table:

In [40]:
fact1 = pd.merge(df_customer, df_rental, on = 'customer_key', how = 'inner')
fact1.head()

# customer_key, rental_key, store_key

,customer_key,first_name,last_name,address,district,phone,rental_key,rental_date,inventory_key,payment_key,payment_amount,payment_date,staff_firstname,staff_lastname,store_key
0,1,MARY,SMITH,1913 Hanoi Way,Nagasaki,28303384290,573,2005-05-28 10:35:23,4020,2,0.99,2005-05-28 10:35:23,Mike,Hillyer,1
1,1,MARY,SMITH,1913 Hanoi Way,Nagasaki,28303384290,1422,2005-06-15 18:02:53,1021,4,0.99,2005-06-15 18:02:53,Jon,Stephens,2
2,1,MARY,SMITH,1913 Hanoi Way,Nagasaki,28303384290,1725,2005-06-16 15:18:57,726,6,4.99,2005-06-16 15:18:57,Mike,Hillyer,1
3,1,MARY,SMITH,1913 Hanoi Way,Nagasaki,28303384290,3284,2005-06-21 06:24:45,4566,9,3.99,2005-06-21 06:24:45,Mike,Hillyer,1
4,1,MARY,SMITH,1913 Hanoi Way,Nagasaki,28303384290,4526,2005-07-08 03:17:05,1443,10,5.99,2005-07-08 03:17:05,Jon,Stephens,2

In [41]:
fact2 = pd.merge(df_inventory,df_film, on = 'film_key', how = 'inner')
fact2.head()
# inventory key, film_key, store_key

,inventory_key,film_key,store_key,title,rental_duration,rental_rate,replacement_cost,rating
0,1,1,1,ACADEMY DINOSAUR,6,0.99,20.99,PG
1,2,1,1,ACADEMY DINOSAUR,6,0.99,20.99,PG
2,3,1,1,ACADEMY DINOSAUR,6,0.99,20.99,PG
3,4,1,1,ACADEMY DINOSAUR,6,0.99,20.99,PG
4,5,1,2,ACADEMY DINOSAUR,6,0.99,20.99,PG

In [42]:
fact_table = pd.merge(fact1, fact2, on = ['inventory_key','store_key'], how = 'inner')
fact_table.head(5)

,customer_key,first_name,last_name,address,district,phone,rental_key,rental_date,inventory_key,payment_key,...,payment_date,staff_firstname,staff_lastname,store_key,film_key,title,rental_duration,rental_rate,replacement_cost,rating
0,1,MARY,SMITH,1913 Hanoi Way,Nagasaki,28303384290,1422,2005-06-15 18:02:53,1021,4,...,2005-06-15 18:02:53,Jon,Stephens,2,228,DETECTIVE VISION,4,0.99,16.99,PG-13
1,135,JUANITA,MASON,943 Johannesburg Avenue,Maharashtra,90921003005,753,2005-05-29 10:16:42,1021,3637,...,2005-05-29 10:16:42,Jon,Stephens,2,228,DETECTIVE VISION,4,0.99,16.99,PG-13
2,237,TANYA,GILBERT,647 A Corua (La Corua) Street,Chollanam,792557457753,11772,2005-08-17 10:18:57,1021,6410,...,2005-08-17 10:18:57,Jon,Stephens,2,228,DETECTIVE VISION,4,0.99,16.99,PG-13
3,1,MARY,SMITH,1913 Hanoi Way,Nagasaki,28303384290,1725,2005-06-16 15:18:57,726,6,...,2005-06-16 15:18:57,Mike,Hillyer,1,159,CLOSER BANG,5,4.99,12.99,R
4,444,MARCUS,HIDALGO,1289 Belm Boulevard,Tartumaa,237368926031,11728,2005-08-17 08:12:26,726,11989,...,2005-08-17 08:12:26,Mike,Hillyer,1,159,CLOSER BANG,5,4.99,12.99,R

In [43]:
# getting the names of all columns before reordering them:
for column in fact_table.columns:
    print(column)

customer_key
first_name
last_name
address
district
phone
rental_key
rental_date
inventory_key
payment_key
payment_amount
payment_date
staff_firstname
staff_lastname
store_key
film_key
title
rental_duration
rental_rate
replacement_cost
rating

In [44]:
ordered_cols = ['customer_key', 'first_name', 'last_name', 'address', 'district', 'phone', 'rental_key', 'rental_date', 'film_key',
               'title','rental_rate', 'rental_duration', 'replacement_cost', 'rating', 'inventory_key', 'payment_key', 'payment_amount',
               'payment_date', 'staff_firstname', 'staff_lastname', 'store_key']

fact_table = fact_table[ordered_cols]
fact_table.head(5)

,customer_key,first_name,last_name,address,district,phone,rental_key,rental_date,film_key,title,...,rental_duration,replacement_cost,rating,inventory_key,payment_key,payment_amount,payment_date,staff_firstname,staff_lastname,store_key
0,1,MARY,SMITH,1913 Hanoi Way,Nagasaki,28303384290,1422,2005-06-15 18:02:53,228,DETECTIVE VISION,...,4,16.99,PG-13,1021,4,0.99,2005-06-15 18:02:53,Jon,Stephens,2
1,135,JUANITA,MASON,943 Johannesburg Avenue,Maharashtra,90921003005,753,2005-05-29 10:16:42,228,DETECTIVE VISION,...,4,16.99,PG-13,1021,3637,3.99,2005-05-29 10:16:42,Jon,Stephens,2
2,237,TANYA,GILBERT,647 A Corua (La Corua) Street,Chollanam,792557457753,11772,2005-08-17 10:18:57,228,DETECTIVE VISION,...,4,16.99,PG-13,1021,6410,5.99,2005-08-17 10:18:57,Jon,Stephens,2
3,1,MARY,SMITH,1913 Hanoi Way,Nagasaki,28303384290,1725,2005-06-16 15:18:57,159,CLOSER BANG,...,5,12.99,R,726,6,4.99,2005-06-16 15:18:57,Mike,Hillyer,1
4,444,MARCUS,HIDALGO,1289 Belm Boulevard,Tartumaa,237368926031,11728,2005-08-17 08:12:26,159,CLOSER BANG,...,5,12.99,R,726,11989,4.99,2005-08-17 08:12:26,Mike,Hillyer,1

In [45]:
drop_columns = ['payment_key', 'store_key']
fact_table.drop(drop_columns, axis = 1, inplace = True)
fact_table.head(5)

,customer_key,first_name,last_name,address,district,phone,rental_key,rental_date,film_key,title,rental_rate,rental_duration,replacement_cost,rating,inventory_key,payment_amount,payment_date,staff_firstname,staff_lastname
0,1,MARY,SMITH,1913 Hanoi Way,Nagasaki,28303384290,1422,2005-06-15 18:02:53,228,DETECTIVE VISION,0.99,4,16.99,PG-13,1021,0.99,2005-06-15 18:02:53,Jon,Stephens
1,135,JUANITA,MASON,943 Johannesburg Avenue,Maharashtra,90921003005,753,2005-05-29 10:16:42,228,DETECTIVE VISION,0.99,4,16.99,PG-13,1021,3.99,2005-05-29 10:16:42,Jon,Stephens
2,237,TANYA,GILBERT,647 A Corua (La Corua) Street,Chollanam,792557457753,11772,2005-08-17 10:18:57,228,DETECTIVE VISION,0.99,4,16.99,PG-13,1021,5.99,2005-08-17 10:18:57,Jon,Stephens
3,1,MARY,SMITH,1913 Hanoi Way,Nagasaki,28303384290,1725,2005-06-16 15:18:57,159,CLOSER BANG,4.99,5,12.99,R,726,4.99,2005-06-16 15:18:57,Mike,Hillyer
4,444,MARCUS,HIDALGO,1289 Belm Boulevard,Tartumaa,237368926031,11728,2005-08-17 08:12:26,159,CLOSER BANG,4.99,5,12.99,R,726,4.99,2005-08-17 08:12:26,Mike,Hillyer

In [46]:
# primary key:
fact_table.insert(0, "order_key", range(1, fact_table.shape[0]+1))
fact_table.head(2)

,order_key,customer_key,first_name,last_name,address,district,phone,rental_key,rental_date,film_key,title,rental_rate,rental_duration,replacement_cost,rating,inventory_key,payment_amount,payment_date,staff_firstname,staff_lastname
0,1,1,MARY,SMITH,1913 Hanoi Way,Nagasaki,28303384290,1422,2005-06-15 18:02:53,228,DETECTIVE VISION,0.99,4,16.99,PG-13,1021,0.99,2005-06-15 18:02:53,Jon,Stephens
1,2,135,JUANITA,MASON,943 Johannesburg Avenue,Maharashtra,90921003005,753,2005-05-29 10:16:42,228,DETECTIVE VISION,0.99,4,16.99,PG-13,1021,3.99,2005-05-29 10:16:42,Jon,Stephens

### insert table into SQL

In [68]:
table_name = "fact_table"
primary_key = "order_key"
db_operation = "insert"

set_dataframe(user_id, pwd, host_name, dst_dbname,fact_table, table_name, primary_key, db_operation)

### Demonstrating Proper Functionality using SQL

In [48]:
dim_customer.head(5)

,customer_key,first_name,last_name,address,district,phone
0,1,MARY,SMITH,1913 Hanoi Way,Nagasaki,28303384290
1,2,PATRICIA,JOHNSON,1121 Loja Avenue,California,838635286649
2,3,LINDA,WILLIAMS,692 Joliet Street,Attika,448477190408
3,4,BARBARA,JONES,1566 Inegl Manor,Mandalay,705814003527
4,5,ELIZABETH,BROWN,53 Idfu Parkway,Nantou,10655648674

In [49]:
dim_rental.head()

,rental_key,rental_date,inventory_key,customer_key,payment_key,payment_amount,payment_date,staff_firstname,staff_lastname,store_key
0,1,2005-05-24 22:53:30,367,130,3504,2.99,2005-05-24 22:53:30,Mike,Hillyer,1
1,5,2005-05-24 23:05:21,2079,222,6003,6.99,2005-05-24 23:05:21,Mike,Hillyer,1
2,6,2005-05-24 23:08:07,2792,549,14728,0.99,2005-05-24 23:08:07,Mike,Hillyer,1
3,9,2005-05-25 00:00:40,2580,126,3386,4.99,2005-05-25 00:00:40,Mike,Hillyer,1
4,13,2005-05-25 00:22:55,2294,334,9014,6.99,2005-05-25 00:22:55,Mike,Hillyer,1

In [50]:
dim_film.head()

,film_key,title,rental_duration,rental_rate,replacement_cost,rating
0,1,ACADEMY DINOSAUR,6,0.99,20.99,PG
1,2,ACE GOLDFINGER,3,4.99,12.99,G
2,3,ADAPTATION HOLES,7,2.99,18.99,NC-17
3,4,AFFAIR PREJUDICE,5,2.99,26.99,G
4,5,AFRICAN EGG,6,2.99,22.99,G

In [51]:
fact_table.head()

,order_key,customer_key,first_name,last_name,address,district,phone,rental_key,rental_date,film_key,title,rental_rate,rental_duration,replacement_cost,rating,inventory_key,payment_amount,payment_date,staff_firstname,staff_lastname
0,1,1,MARY,SMITH,1913 Hanoi Way,Nagasaki,28303384290,1422,2005-06-15 18:02:53,228,DETECTIVE VISION,0.99,4,16.99,PG-13,1021,0.99,2005-06-15 18:02:53,Jon,Stephens
1,2,135,JUANITA,MASON,943 Johannesburg Avenue,Maharashtra,90921003005,753,2005-05-29 10:16:42,228,DETECTIVE VISION,0.99,4,16.99,PG-13,1021,3.99,2005-05-29 10:16:42,Jon,Stephens
2,3,237,TANYA,GILBERT,647 A Corua (La Corua) Street,Chollanam,792557457753,11772,2005-08-17 10:18:57,228,DETECTIVE VISION,0.99,4,16.99,PG-13,1021,5.99,2005-08-17 10:18:57,Jon,Stephens
3,4,1,MARY,SMITH,1913 Hanoi Way,Nagasaki,28303384290,1725,2005-06-16 15:18:57,159,CLOSER BANG,4.99,5,12.99,R,726,4.99,2005-06-16 15:18:57,Mike,Hillyer
4,5,444,MARCUS,HIDALGO,1289 Belm Boulevard,Tartumaa,237368926031,11728,2005-08-17 08:12:26,159,CLOSER BANG,4.99,5,12.99,R,726,4.99,2005-08-17 08:12:26,Mike,Hillyer

In [52]:
# SELECT STATEMENT 1: total purchase amount per customer
sql_test = """
    SELECT customers.`last_name` AS `customer_name`,
        SUM(rentals.`payment_amount`) AS `total_purchase_amt`
    FROM `{0}`.`rental` AS rentals
    INNER JOIN `{0}`.`customer` AS customers
    ON rentals.customer_key = customers.customer_key
    GROUP BY customers.`last_name`;
""".format(dst_dbname)

df_totalquant = get_dataframe(user_id, pwd, host_name, src_dbname, sql_test)

In [53]:
df_totalquant.head(5)

  customer_name  total_purchase_amt
0        HUNTER               59.84
1        HANSEN               44.90
2   CHRISTENSON               33.91
3       WALTERS               56.86
4        ROMERO               90.78

In [54]:
# SELECT STATEMENT 2: average rental rate by rating
sql_test = """
    SELECT film.`rating`,
        AVG(fact_table.`rental_rate`) AS avg_rent_rate 
    FROM `{0}`.`fact_table`
    INNER JOIN `{0}`.`film` 
    ON film.film_key = fact_table.film_key
    GROUP BY film.`rating`;
""".format(dst_dbname)

ratings_rentrate = get_dataframe(user_id, pwd, host_name, src_dbname, sql_test)

In [55]:
ratings_rentrate.head()

  rating  avg_rent_rate
0  PG-13       2.981021
1      R       2.969140
2  NC-17       3.054073
3     PG       3.007413
4      G       2.915926